# 1A:

In [ ]:
import pandas as pd
# read a csv file into a data frame
df = pd.read_csv("customers-100.csv")

In [ ]:
# display the first few rows of a df
df.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [3]:
# display the concise summary of the df, including data types and missing values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Index              100 non-null    int64
 1   Customer Id        100 non-null    object
 2   First Name         100 non-null    object
 3   Last Name          100 non-null    object
 4   Company            100 non-null    object
 5   City               100 non-null    object
 6   Country            100 non-null    object
 7   Phone 1            100 non-null    object
 8   Phone 2            100 non-null    object
 9   Email              100 non-null    object
 10  Subscription Date  100 non-null    object
 11  Website            100 non-null    object
dtypes: int64(1), object(11)
memory usage: 9.5+ KB

In [4]:
# generate descriptive statistics of the df
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [6]:
# get the number of rows and columns of the df
df.shape

(100, 12)

In [ ]:
# count unique values in a column
df['Country'].value_counts()

Country
Solomon Islands                     4
Saint Vincent and the Grenadines    2
Bulgaria                            2
Oman                                2
Netherlands                         2
                                   ..
United States of America            1
Liechtenstein                       1
Denmark                             1
Tanzania                            1
Honduras                            1
Name: count, Length: 85, dtype: int64

In [8]:
# checking for missing values in df
df.isnull()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False,False,False,False,False,False

There are few other functions like,
dropna(), fillna(), groupby(), agg(), concat(), merger(), sort_values(), set_index(), reset_index(), pivot_table(), apply(), cut(), to_csv()

# 2A:

In [9]:
df1 = pd.DataFrame(
    {'Name':['Alice','Bob','Charlie'],
     'Age':[10,15,20]     
     },
     index=['A','B','C']
)

In [10]:
df1

      Name  Age
A    Alice   10
B      Bob   15
C  Charlie   20

In [21]:
def reindex_with_increment(df):
    new_index = range(1,2*len(df),2)
    df.index = new_index
    return df

In [22]:
reindex_with_increment(df1)

      Name  Age
1    Alice   10
3      Bob   15
5  Charlie   20

# 3A:

In [29]:
def sum_first_three_values_df(df):
    total_sum = sum(df['values'].iloc[:3])
    print("The sum of the first three values is: ",total_sum)

In [30]:
df1['values']=[10,20,30]

In [31]:
df1

      Name  Age  values
1    Alice   10      10
3      Bob   15      20
5  Charlie   20      30

In [32]:
sum_first_three_values_df(df1)

The sum of the first three values is:  60

# 4A:

In [38]:
def create_word_count(df):
    new_words_count = [len(x.split()) for x in df['Text']]
    df['Word_Count'] = new_words_count

In [39]:
df2 = pd.DataFrame(
    {'Text':['Hello!',"The sky looks beautiful today","I love exploring new places with friends","Reading books can expand your knowledge and imagination","The serene landscape, with its lush greenery and flowing rivers, was breathtaking"]}
)

In [40]:
create_word_count(df2)

In [41]:
df2

                                                Text  Word_Count
0                                             Hello!           1
1                      The sky looks beautiful today           5
2           I love exploring new places with friends           7
3  Reading books can expand your knowledge and im...           8
4  The serene landscape, with its lush greenery a...          12

# 5A:

## Pandas Size Function
The size property is used to get an int representing the number of elements in this object and return the number of rows if Series. Otherwise, return the number of rows times the number of columns if Dataframe.

## Pandas Shape Function
The shape property is used to get an tuple representing the dimensionality of the pandas dataframe

In [43]:
df2.shape

(5, 2)

In [45]:
df2.size

10

# 6A:

The function to read an Excel in pandas is read_excel()

# 7A:

In [46]:
def extract_username(df):
    new_usernames = [x.split('@')[0] for x in df['Email']]
    df['Username'] = new_usernames

In [47]:
df2['Email'] = ["john.doe@example.com " ,
"jane.smith@example.com",
"alex.williams@example.com ", 
"emily.brown@example.com"  ,
"michael.johnson@example.com"]

In [48]:
df2

,Text,Word_Count,Email
0,Hello!,1,john.doe@example.com
1,The sky looks beautiful today,5,jane.smith@example.com
2,I love exploring new places with friends,7,alex.williams@example.com
3,Reading books can expand your knowledge and im...,8,emily.brown@example.com
4,"The serene landscape, with its lush greenery a...",12,michael.johnson@example.com

In [49]:
extract_username(df2)

In [51]:
df2['Username']

0           john.doe
1         jane.smith
2      alex.williams
3        emily.brown
4    michael.johnson
Name: Username, dtype: object

In [52]:
df2

,Text,Word_Count,Email,Username
0,Hello!,1,john.doe@example.com,john.doe
1,The sky looks beautiful today,5,jane.smith@example.com,jane.smith
2,I love exploring new places with friends,7,alex.williams@example.com,alex.williams
3,Reading books can expand your knowledge and im...,8,emily.brown@example.com,emily.brown
4,"The serene landscape, with its lush greenery a...",12,michael.johnson@example.com,michael.johnson

# 8A:

In [75]:
def df_with_selected_rows(df):
    new_data_frame = df[(df['A']>5) & (df['B']<10)]
    return new_data_frame

In [76]:
df3 = pd.DataFrame(
    {'A':[3,8,6,2,9],
     'B':[5,2,9,3,1],
     'C':[1,7,4,5,2]}
)

In [77]:
df3

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [78]:
df_with_selected_rows(df3)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# 9A:

In [91]:
df4=pd.DataFrame({'Values':[1,2,3,4,5]})

In [96]:
df4.mean()

Values    3.0
dtype: float64

In [97]:
df4.median()

Values    3.0
dtype: float64

In [98]:
df4.std()

Values    1.581139
dtype: float64

# 10A:

In [102]:
def calculate_moving_average(df):
    df = df.sort_values(by='Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [103]:
df5 = pd.DataFrame({'Date':pd.date_range(start='2024-11-01',periods=10),
                    'Sales':[100,200,150,300,400,500,600,700,800,900]})

In [104]:
calculate_moving_average(df5)

        Date  Sales  MovingAverage
0 2024-11-01    100     100.000000
1 2024-11-02    200     150.000000
2 2024-11-03    150     150.000000
3 2024-11-04    300     187.500000
4 2024-11-05    400     230.000000
5 2024-11-06    500     275.000000
6 2024-11-07    600     321.428571
7 2024-11-08    700     407.142857
8 2024-11-09    800     492.857143
9 2024-11-10    900     600.000000

# 11A:

In [107]:
df6 = pd.DataFrame(
    {'Date':pd.date_range(start='2024-11-01',periods=7)}
)

In [109]:
def calculate_week_day(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [110]:
calculate_week_day(df6)

        Date    Weekday
0 2024-11-01     Friday
1 2024-11-02   Saturday
2 2024-11-03     Sunday
3 2024-11-04     Monday
4 2024-11-05    Tuesday
5 2024-11-06  Wednesday
6 2024-11-07   Thursday

# 12A:

In [112]:
df7 = pd.DataFrame({'Date':pd.date_range(start='2024-10-25',periods=20)})

def filter_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    start_date = "2024-11-01"
    end_date = "2024-11-30"
    return df[(df['Date']>=start_date) & (df['Date']<=end_date)]

filter_date_range(df7)

         Date
7  2024-11-01
8  2024-11-02
9  2024-11-03
10 2024-11-04
11 2024-11-05
12 2024-11-06
13 2024-11-07
14 2024-11-08
15 2024-11-09
16 2024-11-10
17 2024-11-11
18 2024-11-12
19 2024-11-13

# 13A:

To use the basic functions of pandas, the first and foremost library that needs to be imported is Pandas itself. This allows you to access the pandas functions like DataFrame, Series and read_csv etc., This is typically done using the following import statement.

In [113]:
import pandas as pd